Tekla.Structures.Analysis.AnalysisPart.ItemTypeEnum
The item types.

Tekla.Structures.Analysis.AnalysisPart.ItemTypeEnum.ITEM_TYPE_UNKNOWN
The item type is unknown.

Tekla.Structures.Analysis.AnalysisPart.ItemTypeEnum.ITEM_TYPE_BAR
The bar item type.

Tekla.Structures.Analysis.AnalysisPart.ItemTypeEnum.ITEM_TYPE_AREA
The area item type.

Tekla.Structures.Analysis.AnalysisPart.ItemTypeEnum.ITEM_TYPE_VOLUME
The volume item type.